Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes Constructor (Drawing)
 Creates a new layout attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LayoutAttributes(
	Drawing Drawing
)
Public Sub New (
	Drawing As Drawing
)
Parameters
Drawing
Type: Tekla.Structures.Drawing.Drawing
The type of drawing to load layout attributes for.
See Also
Reference
LayoutAttributes Class
LayoutAttributes Overload
Tekla.Structures.Drawing Namespace